NYC-Open-Government/app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]